{
  "intents": [
    {
      "tag": "Vice_Chancellor_Office",
      "patterns": [
        "Who is the Vice Chancellor of PMAS-Arid Agriculture University?",
        "Who is leading PMAS-Arid Agriculture University?",
        "What is the Vice Chancellor's name?",
        "What are the Vice Chancellor's responsibilities?",
        "Can you provide the name of the Vice Chancellor?",
        "Who is the current Vice Chancellor at Arid Agriculture University?",
        "Contact details for the Vice Chancellor",
        "How do I contact the Vice Chancellor?",
        "Email address of the Vice Chancellor?",
        "What is the phone number of the Vice Chancellor?",
        "Who is Prof. Dr. Muhammad Naeem?",
        "Tell me about Prof. Dr. Muhammad Naeem",
        "Who is the Vice Chancellor of the university?",
        "What is Prof. Dr. Muhammad Naeem's role at the university?",
        "Can you tell me about the Vice Chancellor's office?",
        "Vice Chancellor contact information",
        "How do I reach the Vice Chancellor's office?",
        "What is the office number of the Vice Chancellor?",
        "Phone number for Vice Chancellor office",
        "Fax number for the Vice Chancellor office",
        "How to send a fax to the Vice Chancellor?",
        "Who is Mr. Muhammad Rafique?",
        "Can you give me the contact of Muhammad Rafique?",
        "What is Mr. Muhammad Rafique's job?",
        "Personal Secretary to the Vice Chancellor",
        "Who is the PS to the Vice Chancellor?",
        "How do I contact the PS to the Vice Chancellor?",
        "What is the email of Mr. Muhammad Rafique?",
        "Phone number of Mr. Muhammad Rafique?",
        "Fax number for Mr. Muhammad Rafique?",
        "Who is the Deputy Registrar?",
        "Tell me about the Deputy Registrar of Arid Agriculture University",
        "Contact details of Mr. Mustafa",
        "What is Mr. Mustafa's phone number?",
        "Who is Mr. Mustafa?",
        "How do I contact Mr. Mustafa?",
        "Deputy Registrar contact details",
        "Email address of the Deputy Registrar",
        "How to contact Mr. Mustafa?",
        "Vice Chancellor's office email",
        "Mr. Muhammad Rafique's role",
        "Who can I contact at the Vice Chancellor's office?",
        "Where is the Vice Chancellor's office located?",
        "How can I send an email to the Vice Chancellor?"
      ],
      "responses": [
        "Prof. Dr. Muhammad Naeem is the Vice Chancellor of PMAS-Arid Agriculture University, Rawalpindi.",
        "The Vice Chancellor of PMAS-Arid Agriculture University is Prof. Dr. Muhammad Naeem.",
        "You can contact Prof. Dr. Muhammad Naeem, the Vice Chancellor, at vc@uaar.edu.pk.",
        "To contact the Vice Chancellor, Prof. Dr. Muhammad Naeem, you can use the following details: \n- Email: vc@uaar.edu.pk \n- Phone: +92-51-9292104 \n- Fax: +92-51-9292107.",
        "Prof. Dr. Muhammad Naeem is leading PMAS-Arid Agriculture University, focusing on advancing agricultural education and research.",
        "The Vice Chancellor's office at PMAS-Arid Agriculture University is headed by Prof. Dr. Muhammad Naeem.",
        "Prof. Dr. Muhammad Naeem holds the position of Vice Chancellor and is responsible for overall leadership and strategic direction of the university.",
        "The Vice Chancellor's office is located at PMAS-Arid Agriculture University, Rawalpindi. For contact: \n- Phone: +92-51-9292104 \n- Fax: +92-51-9292107 \n- Email: vc@uaar.edu.pk.",
        "You can reach the Vice Chancellor, Prof. Dr. Muhammad Naeem, by email at vc@uaar.edu.pk.",
        "For phone inquiries, the Vice Chancellor's office number is +92-51-9292104, and fax is +92-51-9292107.",
        "Prof. Dr. Muhammad Naeem is responsible for guiding the university’s strategic vision and ensuring its academic and administrative functions align with the institution's mission.",
        "To send a fax to the Vice Chancellor’s office, use the number +92-51-9292107.",
        "Mr. Muhammad Rafique serves as the Personal Secretary (PS) to the Vice Chancellor, Prof. Dr. Muhammad Naeem.",
        "You can contact Mr. Muhammad Rafique at the following: \n- Phone: +92-51-9292104 \n- Fax: +92-51-9292107.",
        "Mr. Muhammad Rafique's role is to assist the Vice Chancellor in daily administrative tasks and communication with the university stakeholders.",
        "Mr. Muhammad Rafique is the Personal Secretary (PS) to the Vice Chancellor.",
        "The PS to the Vice Chancellor, Mr. Muhammad Rafique, can be reached at +92-51-9292104.",
        "The fax number for Mr. Muhammad Rafique is the same as the Vice Chancellor’s office: +92-51-9292107.",
        "Mr. Mustafa is the Deputy Registrar at PMAS-Arid Agriculture University.",
        "You can contact Mr. Mustafa, Deputy Registrar, at the following details: \n- Phone: +92-51-9062102 \n- Email: mustafa@uaar.edu.pk.",
        "Mr. Mustafa manages administrative duties as the Deputy Registrar and is responsible for record keeping and university-wide coordination.",
        "To contact Mr. Mustafa, you can email him at mustafa@uaar.edu.pk or call him at +92-51-9062102.",
        "The Deputy Registrar of PMAS-Arid Agriculture University is Mr. Mustafa.",
        "The email address for Mr. Mustafa, Deputy Registrar, is mustafa@uaar.edu.pk.",
        "For general inquiries to the Deputy Registrar, Mr. Mustafa can be contacted via phone at +92-51-9062102.",
        "The Vice Chancellor’s office is managed by Prof. Dr. Muhammad Naeem, and Mr. Muhammad Rafique is his Personal Secretary.",
        "To send an email to the Vice Chancellor, use vc@uaar.edu.pk.",
        "Mr. Muhammad Rafique serves as the key point of contact for the Vice Chancellor's office and manages the communication.",
        "The Vice Chancellor's office is located at PMAS-Arid Agriculture University, Rawalpindi, with phone and fax services available."
      ]
    },
    {
      "tag": "Vice_Chancellor_Message",
      "patterns": [
        "What is the message from the Vice Chancellor?",
        "Can I read the Vice Chancellor's message?",
        "What does the Vice Chancellor say about the university?",
        "Vice Chancellor's vision for the university",
        "What are the Vice Chancellor's thoughts?",
        "What is the Vice Chancellor's welcome message?",
        "Can you share the Vice Chancellor's message?",
        "Message from Prof. Dr. Muhammad Naeem",
        "What is the mission of the university according to the Vice Chancellor?",
        "University mission from the Vice Chancellor",
        "What does Prof. Dr. Muhammad Naeem say about the university?"
      ],
      "responses": [
        "Welcome to PMAS-Arid Agriculture University, Rawalpindi. Being an Agricultural Institution, our main objective is to produce high-quality Agricultural Scientists. Therefore, we are committed to the philosophy that we advance our farmer community by sharing positive and proven ideas and experiences.",
        "Along with Agricultural Sciences, the university offers degree programs at all levels in Basic and Natural Sciences, Social Sciences, Humanities, Management Sciences, Computer Sciences, and Information Technology.",
        "The University seeks to make a major contribution to agricultural advancement across the country. Therefore, we are dedicated to the prosecution of research across all fields of study, believing in research culture with clear application and relevance.",
        "With a dynamic and stimulating educational environment, our tradition is to accept challenges and to receive wisdom today, in order to achieve new things and new approaches for tomorrow.",
        "Embracing education in its widest context, we continually strive to remain at the forefront of knowledge. We are committed to preparing our students to work, acquire skills, and enhance their capabilities that equip them adequately to live in a rapidly changing global environment."
      ]
    },
    {
      "tag": "University_Programs",
      "patterns": [
        "What programs does the university offer?",
        "Which degree programs are available at PMAS-Arid Agriculture University?",
        "What degrees can I pursue at PMAS-Arid Agriculture University?",
        "Degree programs at the university",
        "What courses does PMAS-Arid Agriculture University provide?",
        "Can I study social sciences at the university?",
        "Does the university offer computer science programs?",
        "What fields of study are available at PMAS-Arid Agriculture University?",
        "Can I get a degree in agricultural sciences?",
        "What are the academic programs at PMAS-Arid Agriculture University?"
      ],
      "responses": [
        "PMAS-Arid Agriculture University offers a variety of degree programs in Agricultural Sciences, Basic and Natural Sciences, Social Sciences, Humanities, Management Sciences, Computer Sciences, and Information Technology.",
        "Students can pursue degrees at undergraduate, graduate, and doctoral levels in various fields such as agriculture, computer science, business management, biochemistry, environmental sciences, and more.",
        "The university offers a wide range of programs including Bachelor's, Master's, and Ph.D. degrees in subjects like agronomy, horticulture, veterinary sciences, microbiology, information technology, and economics."
      ]
    }
  ]
}
