{
  "intents": [
    {
      "tag": "greeting",
      "patterns": [
        "Hello", 
        "Hi", 
        "Hey", 
        "Greetings", 
        "Good morning", 
        "Good afternoon", 
        "Good evening", 
        "How are you?", 
        "What is up?", 
        "Whats new?", 
        "How is it going?", 
        "Nice to meet you", 
        "How do you do?", 
        "Yo", 
        "Howdy", 
        "What is happening?"
      ],
      "responses": [
        "Hello! How can I assist you today?", 
        "Hi there! What do you need help with?", 
        "Greetings! How can I help you?", 
        "Hey! What can I do for you?", 
        "Good to see you! How can I assist?", 
        "Hello! What is on your mind?"
      ],
      "context": [""]
    },
    {
      "tag": "goodbye",
      "patterns": [
        "Goodbye", 
        "See you later", 
        "Farewell", 
        "Catch you later", 
        "Take care", 
        "I am leaving", 
        "See you soon", 
        "Talk to you later", 
        "Have a good day", 
        "I will be back", 
        "Bye"
      ],
      "responses": [
        "Goodbye! Have a great day!", 
        "See you later! Take care!", 
        "Farewell! Looking forward to our next chat!", 
        "Catch you later! Stay safe!", 
        "Take care! Talk soon!"
      ],
      "context": [""]
    },
    {
      "tag": "thanks",
      "patterns": [
        "Thank you", 
        "Thanks", 
        "I appreciate it", 
        "Thanks a lot", 
        "Thank you very much", 
        "Thanks for your help", 
        "I am grateful", 
        "Thank you for that", 
        "I appreciate your assistance", 
        "Thanks for everything", 
        "You are awesome", 
        "Thanks for your support"
      ],
      "responses": [
        "You are welcome!", 
        "No problem! Happy to help!", 
        "I am glad I could assist!", 
        "Thank you! Your satisfaction is my priority!", 
        "I value our conversations! Let me know if you need assistance!"
      ],
      "context": [""]
    },
    {
      "tag": "joke",
      "patterns": [
        "Tell me a joke", 
        "Make me laugh", 
        "I want to hear a joke", 
        "Give me a joke", 
        "Do you have a joke?", 
        "I need a laugh", 
        "Joke me", 
        "Tell me something funny", 
        "What is a good joke?", 
        "I could use some humor", 
        "Lighten the mood with a joke", 
        "Can you tell me a funny story?", 
        "What is your favorite joke?", 
        "Give me something to smile about", 
        "Share a funny joke with me", 
        "Hit me with a joke", 
        "I love jokes", 
        "Let us have a laugh", 
        "Bring on the jokes", 
        "I enjoy humor", 
        "I need something funny"
      ],
      "responses": [
        "Why do not scientists trust atoms? Because they make up everything!", 
        "I told my computer I needed a break, and now it will not stop sending me to a page that says Error 404: Not Found!", 
        "Why did the scarecrow win an award? Because he was outstanding in his field!", 
        "I asked the librarian if the library had any books on paranoia. She whispered, They are right behind you!", 
        "What do you call fake spaghetti? An impasta!", 
        "Why do not skeletons fight each other? They do not have the guts!", 
        "I would tell you a joke about an elevator, but it is an uplifting experience!", 
        "Why did the math book look sad? Because it had too many problems!", 
        "What did one wall say to the other wall? I will meet you at the corner!", 
        "I told my wife she was drawing her eyebrows too high. She looked surprised!", 
        "Why was the computer cold? Because it left its Windows open!", 
        "Did you hear about the claustrophobic astronaut? He just needed a little space!", 
        "Why can not you give Elsa a balloon? Because she will let it go!", 
        "I used to play piano by ear, but now I use my hands!", 
        "Why did the coffee file a police report? It got mugged!", 
        "I would tell you a chemistry joke, but I know I would not get a reaction!", 
        "Why did the golfer bring two pairs of pants? In case he got a hole in one!", 
        "Why do not oysters share their pearls? Because they are shellfish!", 
        "What do you call cheese that is not yours? Nacho cheese!", 
        "I told my dog to play dead, and now he is just lying around!"
      ],
      "context": [""]
    },
    {
      "tag": "help",
      "patterns": [
        "Can you help me?", 
        "I need assistance", 
        "Help me out", 
        "I am looking for help", 
        "Can you assist?", 
        "I require support", 
        "Please help me", 
        "I need guidance", 
        "Can you help with this?", 
        "I am having trouble", 
        "Can you provide assistance?", 
        "I am stuck", 
        "I need some help", 
        "Can you help with my question?", 
        "Please assist me", 
        "I would like some help", 
        "I am looking for advice", 
        "Can you give me a hand?", 
        "I am in need of help", 
        "I need your expertise", 
        "Could you assist me?"
      ],
      "responses": [
        "Of course! What do you need help with?", 
        "I am here to assist you! Please tell me your issue.", 
        "Absolutely! Let me know how I can help you.", 
        "I would be glad to help! What do you need assistance with?", 
        "Sure! Please share your query with me.", 
        "I am here for you! What can I assist you with today?", 
        "I am ready to help! Please describe your problem.", 
        "Yes! Just tell me what you need assistance with.", 
        "I can help! What is troubling you?", 
        "I am here to support you! What can I do for you?", 
        "Let me know how I can assist! I am ready to help.", 
        "Sure! Your concerns are important. What can I help with?", 
        "I am here to provide assistance! Just let me know.", 
        "Absolutely! I am eager to help with your request.", 
        "I can definitely assist! Please share your issue.", 
        "I am here to help! Let me know what you need.", 
        "Of course! Your needs are my priority. What can I do for you?", 
        "Yes! I am here to offer guidance. What do you need help with?"
      ],
      "context": [""]
    },
    {
      "tag": "weather",
      "patterns": [
        "What is the weather like?", 
        "Tell me the weather", 
        "How is the weather today?", 
        "What is the forecast?", 
        "Will it rain today?", 
        "Is it sunny outside?", 
        "What is the temperature?", 
        "How is the weather looking?", 
        "Do I need an umbrella?", 
        "What is the weather report?", 
        "How hot is it?", 
        "Is it cold outside?", 
        "What is the weather like tomorrow?", 
        "Will it snow today?", 
        "What is the humidity level?", 
        "How windy is it today?", 
        "What should I wear today?", 
        "How is the weather in my area?", 
        "Tell me the weather for this week", 
        "What is the UV index today?", 
        "Is it a good day for a picnic?"
      ],
      "responses": [
        "I am currently unable to fetch weather data. Please check a reliable weather website.", 
        "Unfortunately, I cannot provide real-time weather updates. Try a weather app or website for the latest info.", 
        "I cannot check the weather right now. Please consult your local weather service.", 
        "I do not have access to weather forecasts. Please look at a weather app for details.", 
        "I am unable to provide weather information. Please check a weather-related site for updates.", 
        "Sorry, but I cannot provide live weather updates. It is best to check a weather application."
      ],
      "context": [""]
    },
    {
      "tag": "news",
      "patterns": [
        "What is the news?", 
        "Tell me the latest news", 
        "What is happening in the world?", 
        "Give me news updates", 
        "What is trending?", 
        "Any news today?", 
        "Tell me the current events", 
        "What is the latest news?", 
        "What is in the headlines?", 
        "Share some news with me", 
        "Any breaking news?", 
        "What are the top stories?", 
        "What is going on in the news?", 
        "What are people talking about?", 
        "Can you provide news updates?", 
        "What is the latest in the world?", 
        "What news do you have?", 
        "Give me the current news", 
        "What are the news highlights?", 
        "Tell me what is new in the world?"
      ],
      "responses": [
        "I cannot provide real-time news updates. Please check a reliable news website.", 
        "Unfortunately, I do not have access to live news feeds. It is best to check a news app or website for the latest information.", 
        "I am unable to fetch news articles at the moment. Please consult a news platform for updates.", 
        "Sorry, but I cannot provide current news. Try a news application for the latest updates.", 
        "I cannot access news reports right now. Please look at a news website for details."
      ],
      "context": [""]
    }
  ]
}
